In [2]:
# Overview 
'''
This section focuses on Data Cleansing & Manipulation
The Data cleansing part of this section will focus on:
 * Functions that can deal with null values, specifically
     -  NVL()
     - Coalesce()
 * Functions that can clean values, specifically 
     - trim(), 
     - lpad() 
     - rpad()
 
The Data Manipulation part of this course will show you how to 
    - PIVOT 
    - UNPIVOT 
your data, this is very useful if you want to have a pivoted view of your table or if you want to unpivot a pivoted table view.
'''

'\nThis section focuses on Data Cleansing & Manipulation\nThe Data cleansing part of this section will focus on:\n * Functions that can deal with null values, specifically\n     -  NVL()\n     - Coalesce()\n * Functions that can clean values, specifically \n     - trim(), \n     - lpad() \n     - rpad()\n \nThe Data Manipulation part of this course will show you how to \n    - PIVOT \n    - UNPIVOT \nyour data, this is very useful if you want to have a pivoted view of your table or if you want to unpivot a pivoted table view.\n'

In [4]:
# Coalesce and NVL
'''
--  Coalesce
select store_name,web_address, coalesce(web_address,store_name) from stores;
select store_name,web_address, coalesce(store_name,web_address) from stores;
select store_name,web_address, coalesce(store_name,web_address, store_id) from stores; --error

-- NVL 
select * from emp order by empno;
select emp.*, nvl(comm,0) from emp; 
select emp.*, nvl(comm,'NO Commision') from emp;  -- Error: Invalid Number

insert into emp values(0, null, 'test', 0, sysdate, 1000, null , 10);
select emp.* , nvl(ename,'no name') from emp order by empno;

delete from emp where empno=0;

'''

# In SQL Server and MySQL the Equivalent functions to NVL() ISNULL() which takes the same parameters
# what is difference between coalesce() and isNull()

'''
`coalesce()` and `isNull()` are two different functions used in SQL and other programming languages to handle NULL values, but they serve different purposes:

1. `coalesce()`:
   - `coalesce()` is a function used to return the first non-NULL value in a list of expressions.
   - It takes multiple arguments and returns the first non-NULL argument. If all arguments are NULL, it returns NULL.
   - Example in SQL:
     ```sql
     SELECT COALESCE(column1, column2, column3, 'Default') AS result FROM table_name;
     ```
   - In this example, `coalesce()` will return the first non-NULL value among `column1`, `column2`, and `column3`, and if all of them are NULL, it will return 'Default'.

2. `isNull()` or `IS NULL`:
   - `isNull()` or `IS NULL` is used to check whether a specific expression or column contains a NULL value.
   - It returns a Boolean result, i.e., either `TRUE` if the expression is NULL or `FALSE` if it is not NULL.
   - Example in SQL:
     ```sql
     SELECT column1, column2 FROM table_name WHERE column3 IS NULL;
     ```
   - In this example, the `IS NULL` condition is used to filter rows where `column3` contains NULL values.

In summary, `coalesce()` is used to return a non-NULL value from a list of expressions, while `isNull()` or `IS NULL` is used to check if a specific expression or column is NULL or not. They serve different purposes in handling NULL values in SQL and other programming contexts.

'''

"\n`coalesce()` and `isNull()` are two different functions used in SQL and other programming languages to handle NULL values, but they serve different purposes:\n\n1. `coalesce()`:\n   - `coalesce()` is a function used to return the first non-NULL value in a list of expressions.\n   - It takes multiple arguments and returns the first non-NULL argument. If all arguments are NULL, it returns NULL.\n   - Example in SQL:\n     ```sql\n     SELECT COALESCE(column1, column2, column3, 'Default') AS result FROM table_name;\n     ```\n   - In this example, `coalesce()` will return the first non-NULL value among `column1`, `column2`, and `column3`, and if all of them are NULL, it will return 'Default'.\n\n2. `isNull()` or `IS NULL`:\n   - `isNull()` or `IS NULL` is used to check whether a specific expression or column contains a NULL value.\n   - It returns a Boolean result, i.e., either `TRUE` if the expression is NULL or `FALSE` if it is not NULL.\n   - Example in SQL:\n     ```sql\n     SELECT column1, column2 FROM table_name WHERE column3 IS NULL;\n     ```\n   - In this example, the `IS NULL` condition is used to filter rows where `column3` contains NULL values.\n\nIn summary, `coalesce()` is used to return a non-NULL value from a list of expressions, while `isNull()` or `IS NULL` is used to check if a specific expression or column is NULL or not. They serve different purposes in handling NULL values in SQL and other programming contexts.\n\n"

In [5]:
# Trim and PAD (lpad, rpad)
'''
-- trim 
select * from emp;
select ename, trim('K' from ename) from emp; -- default is BOTH
select length(trim(' ' from '   whitepsace   ')) from dual;
select length(trim(LEADING  ' ' from '   whitepsace   ')) from dual;
select length(trim(TRAILING ' ' from '   whitepsace   ')) from dual;

-- lpad, rpad 
select * from emp;
select lpad(empno, 5,0) from emp;
select job, rpad(job, 6,'X') from emp;  ### if more then six trauncate , if less then than that then pad with X
select rpad(sal, length(sal)+3, 0) from emp;
'''

"\n-- trim \nselect * from emp;\nselect ename, trim('K' from ename) from emp; -- default is BOTH\nselect length(trim(' ' from '   whitepsace   ')) from dual;\nselect length(trim(LEADING  ' ' from '   whitepsace   ')) from dual;\nselect length(trim(TRAILING ' ' from '   whitepsace   ')) from dual;\n\n-- lpad, rpad \nselect * from emp;\nselect lpad(empno, 5,0) from emp;\nselect job, rpad(job, 6,'X') from emp;\nselect rpad(sal, length(sal)+3, 0) from emp;\n"

In [4]:
# Greatest and Least
'''
-- Greatest and Least
select * from emp;
select emp.*, least(sal, 3000) from emp;       --max salary sould be 3k 
select emp.*, greatest(sal, 1000) from emp;    -- least salary should be 1k, 1000 minium hogi , max kitni bhi ho sakti hai
'''

In [10]:
#Pivoting Tables
'''
-- pivoting
select * from eba_countries;

-- Query 1
select * from 
(
    select region_id, sub_region_id, population from eba_countries
)
pivot(sum(population) for region_id in (10,20,30,40,50))
order by SUB_REGION_ID;;

X-Axis : REGION_ID 
y-AXIS  : SUB_REGION_ID 
x,y co-ordinate: sum(populiation)

select distinct region_id from eba_countries;

-- Query2
select * from 
(
    select region_id, sub_region_id from eba_countries
)
pivot(count(region_id) for region_id in (10,20,30,40,50));

'''


################# PIVOTING => MATRIX VIEW ##################################
## Task : hume chaaiye, REGION_ID as column name , subregion_ID as rows and population as total .
# So there will be six columns 1. SUB_REGION_ID , rest region_ID values
### 1. REGION_ID : 10,20,30,40, 50
### 2. ab column values ko Columns ke naam me convert karna hai [ Column_names = [subregion_ID,10, 20, 30, 40, 50] ]

'\n-- pivoting\nselect * from eba_countries;\n\n-- Query 1\nselect * from \n(\n    select region_id, sub_region_id, population from eba_countries\n)\npivot(sum(population) for region_id in (10,20,30,40,50));\n\nselect distinct region_id from eba_countries;\n\n-- Query2\nselect * from \n(\n    select region_id, sub_region_id, population from eba_countries\n)\npivot(count(population) for region_id in (10,20,30,40,50));\n\n'

In [7]:
# UnPivoting Tables
'''
-- UN-pivoting

create table avg_test_scores(class varchar(10), maths number , science number,english number)

insert into avg_test_scores values('7A', 80, 67, 89);
insert into avg_test_scores values('7B', 70, 50, 80);
insert into avg_test_scores values ('7C', 80, 80, 90);

select * from avg_test_scores;


select * from avg_test_scores
unpivot(<FIELD_NAME_FOR_MARKS> for <FIELD_NAME_FOR_SUBJECTS> in (MATHS,SCIENCE, ENGLISH) );

select * from avg_test_scores
unpivot(scores for subjects in (MATHS,SCIENCE, ENGLISH) );

select * from avg_test_scores
unpivot(avg_score for subject in (MATHS, SCIENCE, ENGLISH))


select * from avg_test_scores
unpivot(avg_score for subject in (MATHS as 'Mathemetics', SCIENCE, ENGLISH));
'''
# UNPIVOT - OPPOSITE OF PIVOT 
# PIVOT  => Column ke jo value hoti hai usko column ke naam main convert kar deta hai  
# so unpivot => ho hamare table ke columns hai unko naye column ke values bana denga , simple

"\n-- UN-pivoting\n\ncreate table avg_test_scores(class varchar(10), maths number , science number,english number)\n\ninsert into avg_test_scores values('7A', 80, 67, 89);\ninsert into avg_test_scores values('7B', 70, 50, 80);\ninsert into avg_test_scores values ('7C', 80, 80, 90);\n\nselect * from avg_test_scores;\n\n\nselect * from avg_test_scores\nunpivot(avg_score for subject in (MATHS, SCIENCE, ENGLISH))\n\n\nselect * from avg_test_scores\nunpivot(avg_score for subject in (MATHS as 'Mathemetics', SCIENCE, ENGLISH));\n"

In [2]:
# Assignment Question 1
'''
Pivot the EMP Table to show the total salary by JOB and DEPTNO in matrix form 
 => (pivoting the JOB column) as per the screenshot below

X-AXIS: JOB 
Y-AXIS: DEPT , as rows values 
x,y co-ordinate : total salary by JOB and DEPTNO in matrix

select * from emp;

select distinct job from emp  -- ('ANALYST', 'CLERK','SALESMAN','MANAGER','PRESIDENT')

select * FROM 
(select deptno, job, sal from emp) 
pivot(sum(sal) for job in ('ANALYST', 'CLERK','SALESMAN','MANAGER','PRESIDENT'));

'''

# Column name is DEPTNO, ANALYST, CLERK, SALESMAN, MANAGER , PRESIDENT 

################# PIVOTING ##################################
### 1. JOB Columns : CLERK , SALESMAN , MANAGER , PRESIDENT HAI 
### 2. NOW in column values ko Columns ke naam me convert karna hai

"\nPivot the EMP Table to show the total salary by JOB and DEPTNO in matrix form \n => (pivoting the JOB column) as per the screenshot below\n\nX-AXIS: JOB \nY-AXIS: DEPT , as rows values \nx,y co-ordinate : total salary by JOB and DEPTNO in matrix\n\nselect * from emp;\n\nselect distinct job from emp  -- ('ANALYST', 'CLERK','SALESMAN','MANAGER','PRESIDENT')\n\nselect * FROM \n(select deptno, job, sal from emp) \npivot(sum(sal) for job in ('ANALYST', 'CLERK','SALESMAN','MANAGER','PRESIDENT'));\n\n"

In [3]:
# Assignment Question 2
'''
Enter the following Create Table command to create a table that will store information about 
how many goals players have scored across 3 seasons (2018, 2019 and 2020)

create table goals_per_season(player varchar(10), year_2018 int, year_2019 int, year_2020 int);

Now individually execute the 3 Insert commands to insert records into our newly created table

insert into goals_per_season values ('Rick', 51,31,38);
insert into goals_per_season values ('Jeff', 28,37,36);
insert into goals_per_season values ('George', 40,55,48);

Your assignment question is to UNPIVOT the GOALS_PER_SEASON Table to look like the screenshot below
'''

"\nEnter the following Create Table command to create a table that will store information about \nhow many goals players have scored across 3 seasons (2018, 2019 and 2020)\n\ncreate table goals_per_season(player varchar(10), year_2018 int, year_2019 int, year_2020 int);\n\nNow individually execute the 3 Insert commands to insert records into our newly created table\n\ninsert into goals_per_season values ('Rick', 51,31,38);\ninsert into goals_per_season values ('Jeff', 28,37,36);\ninsert into goals_per_season values ('George', 40,55,48);\n\nYour assignment question is to UNPIVOT the GOALS_PER_SEASON Table to look like the screenshot below\n\n\nPLAYER , SEASON , GOALS\nRICK, 2018, 51\nRICK, 2019, 31\n\n#######\nselect * from goals_per_season\nunpivot(goals for year in (YEAR_2018,YEAR_2019,YEAR_2020));\n\nselect * from goals_per_season\nunpivot(goals for year in (YEAR_2018 as '2018',YEAR_2019 as '2019',YEAR_2020 as '2020'));\n\n\nSELECT * FROM GOALS_PER_SEASON\nUNPIVOT(GOALS FOR SEASON IN (YEAR_2018 AS '2018', YEAR_2019 AS '2019', YEAR_2020 AS '2020'));\n\n"

In [4]:
# SOlution
'''

PLAYER , SEASON , GOALS
RICK, 2018, 51
RICK, 2019, 31

#######
select * from goals_per_season
unpivot(goals for year in (YEAR_2018,YEAR_2019,YEAR_2020));

select * from goals_per_season
unpivot(goals for year in (YEAR_2018 as '2018',YEAR_2019 as '2019',YEAR_2020 as '2020'));


SELECT * FROM GOALS_PER_SEASON
UNPIVOT(GOALS FOR SEASON IN (YEAR_2018 AS '2018', YEAR_2019 AS '2019', YEAR_2020 AS '2020'));

'''

"\n\nPLAYER , SEASON , GOALS\nRICK, 2018, 51\nRICK, 2019, 31\n\n#######\nselect * from goals_per_season\nunpivot(goals for year in (YEAR_2018,YEAR_2019,YEAR_2020));\n\nselect * from goals_per_season\nunpivot(goals for year in (YEAR_2018 as '2018',YEAR_2019 as '2019',YEAR_2020 as '2020'));\n\n\nSELECT * FROM GOALS_PER_SEASON\nUNPIVOT(GOALS FOR SEASON IN (YEAR_2018 AS '2018', YEAR_2019 AS '2019', YEAR_2020 AS '2020'));\n\n"